profiling/artillery-with-console-log.txt
Phase started: unnamed (index: 0, duration: 1s) 09:07:27(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 09:07:28(-0300)

--------------------------------------
Metrics for period to: 09:07:30(-0300) (width: 2.726s)
--------------------------------------

http.codes.200: ................................................................ 122
http.request_rate: ............................................................. 56/sec
http.requests: ................................................................. 152
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 1202
  median: ...................................................................... 450.4
  p95: ......................................................................... 620.3
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 122
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 09:07:40(-0300) (width: 9.989s)
--------------------------------------

http.codes.200: ................................................................ 539
http.request_rate: ............................................................. 56/sec
http.requests: ................................................................. 539
http.response_time:
  min: ......................................................................... 97
  max: ......................................................................... 1766
  median: ...................................................................... 507.8
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1274.3
http.responses: ................................................................ 539


--------------------------------------
Metrics for period to: 09:07:50(-0300) (width: 6.232s)
--------------------------------------

http.codes.200: ................................................................ 339
http.request_rate: ............................................................. 51/sec
http.requests: ................................................................. 309
http.response_time:
  min: ......................................................................... 55
  max: ......................................................................... 2007
  median: ...................................................................... 407.5
  p95: ......................................................................... 757.6
  p99: ......................................................................... 1556.5
http.responses: ................................................................ 339
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16631.8
  max: ......................................................................... 18483.9
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18220


All VUs finished. Total time: 19 seconds

--------------------------------
Summary report @ 09:07:46(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 14
  max: ......................................................................... 2007
  median: ...................................................................... 468.8
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1436.8
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16631.8
  max: ......................................................................... 18483.9
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18220