profiling/artillery-without-console-log.txt
Phase started: unnamed (index: 0, duration: 1s) 08:53:37(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 08:53:38(-0300)

--------------------------------------
Metrics for period to: 08:53:40(-0300) (width: 2.27s)
--------------------------------------

http.codes.200: ................................................................ 113
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 137
http.response_time:
  min: ......................................................................... 13
  max: ......................................................................... 898
  median: ...................................................................... 415.8
  p95: ......................................................................... 645.6
  p99: ......................................................................... 685.5
http.responses: ................................................................ 113
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 08:53:50(-0300) (width: 9.98s)
--------------------------------------

http.codes.200: ................................................................ 523
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 517
http.response_time:
  min: ......................................................................... 123
  max: ......................................................................... 1979
  median: ...................................................................... 459.5
  p95: ......................................................................... 742.6
  p99: ......................................................................... 1465.9
http.responses: ................................................................ 523


--------------------------------------
Metrics for period to: 08:54:00(-0300) (width: 6.596s)
--------------------------------------

http.codes.200: ................................................................ 364
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 346
http.response_time:
  min: ......................................................................... 54
  max: ......................................................................... 1991
  median: ...................................................................... 415.8
  p95: ......................................................................... 727.9
  p99: ......................................................................... 1495.5
http.responses: ................................................................ 364
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16090.4
  max: ......................................................................... 18505.3
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18588.1


All VUs finished. Total time: 19 seconds

--------------------------------
Summary report @ 08:53:57(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 57/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 13
  max: ......................................................................... 1991
  median: ...................................................................... 432.7
  p95: ......................................................................... 727.9
  p99: ......................................................................... 1495.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16090.4
  max: ......................................................................... 18505.3
  median: ...................................................................... 17505.6
  p95: ......................................................................... 18220
  p99: ......................................................................... 18588.1