profiling/autocannon-with-console-log.txt
> autocannon -c 100 -d 20 http://localhost:8080/api/info?log=true

Running 20s test @ http://localhost:8080/api/info?log=true
100 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1131 ms │ 1421 ms │ 2880 ms │ 3111 ms │ 1495.88 ms │ 394.22 ms │ 3951 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬───────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼───────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 69      │ 89      │ 64.41   │ 20.4  │ 18      │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼───────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 47.4 kB │ 61.1 kB │ 44.1 kB │ 14 kB │ 12.3 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴───────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

1k requests in 20.12s, 883 kB read